Tekla.Structures.Analysis.AnalysisPartSpanningProperties
The AnalysisPartSpanningProperties class contains information related to analysis part spanning properties.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties._SpanningType
The spanning type of the analysis part.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties._SpanningDirection
The spanning direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties.SpanningType
The spanning type.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties.SpanningDirection
The spanning direction (in the global coordinate system).